fQwQf/A20OS/kernel/platform/stm32f103/peripherals.c
#ifdef CONFIG_BOARD_STM32F103

#include "peripherals.h"
#include "core/stdio.h"
#include "core/string.h"
#include "core/timer.h"
#include "mm/slab.h"
#include "actuators.h"
#include "board.h"
#include "bluetooth.h"
#include "cjk_font.h"
#include "dht11.h"
#include "display.h"
#include "extsram.h"
#include "hub_config.h"
#include "hub_controller.h"
#include "hub_proto.h"
#include "hub_ui.h"
#include "ir.h"
#include "live2d.h"
#include "live2d_load.h"
#include "rtc.h"
#include "rgb_matrix.h"
#include "stm32_uart.h" /* stm32_hclk_hz() for the diagnostics page */
#include "ui_diag.h"
#include "ui_home.h"
#include "ui_render.h"
#include "keys.h"
#include "light_sensor.h"
#include "memory.h"
#include "sdcard.h"
#include "sdfs.h"
#include "touch.h"
#include "watchdog.h"
#include "touch_cal.h"
#include "wifi.h"

#define TOUCH_POLL_INTERVAL_MS 20U
#define KEY_POLL_INTERVAL_MS 20U
#define BLUETOOTH_POLL_INTERVAL_MS 20U
#define WIFI_POLL_INTERVAL_MS 20U
#define MEMORY_POLL_INTERVAL_MS 1000U
#define LIGHT_POLL_INTERVAL_MS 250U
#define SDCARD_CHECK_INTERVAL_MS 2000U
#define SERVICE_SLOW_THRESHOLD_MS 25U
#define CONTROL_TICK_INTERVAL_MS 2000U
#define MANUAL_OVERRIDE_MS 600000U
#define TOUCH_LONG_PRESS_MS 700U

static stm32_peripheral_state_t peripherals;
static uint64_t last_touch_poll;
static uint64_t last_key_poll;
static uint64_t last_bluetooth_poll;
static uint64_t last_wifi_poll;
static uint64_t last_memory_poll;
static uint64_t last_light_poll;
static uint64_t last_sdcard_check;
static uint64_t last_control_tick;
static uint32_t last_live2d_clock;
static int touch_pressed;
static uint16_t touch_down_x;
static uint16_t touch_down_y;
static uint16_t touch_last_x;
static uint16_t touch_last_y;
static uint64_t touch_down_at;
static char bluetooth_line[STM32_BLUETOOTH_LINE_MAX];

/* Smart-hub control state. */
static hub_controller_t hub_ctl;
static int dht_present;
static int16_t last_temp_c;
static uint8_t last_humidity;
static int have_env;
static uint64_t buzzer_off_at;
static int buzzer_active;
static int buzzer_muted;
static uint8_t net_seq; /* SNAPSHOT frame sequence number       */
static int ir_present;

/* --- cloud control over the non-blocking wifi.c TCP socket --- */
/*
 * How long a SNAPSHOT waits for its CONTROL. This has to cover a real LLM
 * round-trip, not just the wire: measured on the bench, the proxy's live call
 * (deepseek-v4-flash) takes 2.5-2.6s, on top of ~140ms RTT and ~75ms to shift a
 * ~70-byte frame in over the ESP8266's 9600 baud link. At the old 1500ms every
 * live reply arrived after cloud_awaiting had already been cleared and was
 * dropped by the seq/deadline check below — no speech ever reached the bubble,
 * and the catgirl never saw a cloud mood. Keep it under CLOUD_FRESH_MS so a
 * reply that is accepted is still fresh enough to apply.
 */
#define CLOUD_REPLY_TIMEOUT_MS 6000U
/*
 * How long a cloud decision keeps overriding the local rules. Must outlast the
 * gap between asks (CLOUD_HEARTBEAT_MS) plus a reply, or the decision would
 * lapse back to local between heartbeats and the source would flap.
 */
#define CLOUD_FRESH_MS 40000U
#define CLOUD_CONNECT_BACKOFF_MS 5000U  /* retry cadence for CIPSTART          */
static char cloud_proxy_ip[16] = HUB_PROXY_IP;
static uint16_t cloud_proxy_port = HUB_PROXY_PORT;
static uint8_t cloud_rx[HUB_OVERHEAD + HUB_MAX_PAYLOAD]; /* frame reassembly    */
static size_t cloud_rx_len;
static uint64_t cloud_connect_retry_at;
static int cloud_awaiting;           /* SNAPSHOT sent, CONTROL not yet parsed  */
static uint8_t cloud_expected_seq;
static uint64_t cloud_reply_deadline;
static hub_control_t cloud_last;     /* most recent CONTROL from the proxy     */
static int cloud_last_valid;
static uint64_t cloud_last_ms;

/*
 * When is it worth asking the cloud?
 *
 * Every control tick (2s) was wrong on three counts. It re-asked an LLM to
 * narrate a room that had not changed — ~900 calls an hour, real money for no
 * information. Each reply carried a new speech line, and a new line restarts
 * TALK for up to 6s; at one line every ~4s the catgirl never left TALK, so the
 * cloud mood was never applied (a live TALK outranks it) and IDLE never got to
 * park — which silently undid the whole point of making IDLE a one-shot.
 *
 * So: ask on a real change, on an explicit request (tapping the cat), or on a
 * slow heartbeat. Light is deliberately not a trigger — it swings tens of
 * percent as people move past the sensor and says nothing about comfort.
 */
#define CLOUD_HEARTBEAT_MS 30000U /* refresh even when nothing changed */
#define CLOUD_TEMP_DELTA 2        /* degC that counts as "something changed" */
#define CLOUD_HUMI_DELTA 5        /* %RH  */

static uint64_t cloud_last_ask_ms;
static env_snapshot_t cloud_asked_snap; /* what the last ask described */
static int cloud_ask_now;               /* set by a tap: ask on the next tick */

static int abs_diff(int a, int b) { return a > b ? a - b : b - a; }

static int cloud_should_ask(const env_snapshot_t *s, uint64_t now) {
    if (cloud_ask_now || cloud_last_ask_ms == 0)
        return 1;
    if (now - cloud_last_ask_ms >= CLOUD_HEARTBEAT_MS)
        return 1;
    if (s->valid != cloud_asked_snap.valid)
        return 1; /* the sensor came back or died — worth a word */
    if (!s->valid)
        return 0;
    if (abs_diff(s->temp_c, cloud_asked_snap.temp_c) >= CLOUD_TEMP_DELTA)
        return 1;
    if (abs_diff(s->humidity, cloud_asked_snap.humidity) >= CLOUD_HUMI_DELTA)
        return 1;
    if (s->hour != cloud_asked_snap.hour)
        return 1; /* the hour drives night/day behaviour */
    return 0;
}

static void cloud_parse_frames(uint64_t now) {
    size_t off = 0;

    while (off < cloud_rx_len) {
        hub_frame_t f;
        int r = hub_proto_parse(cloud_rx + off, cloud_rx_len - off, &f);
        if (r == 0)
            break;
        if (r < 0) {
            off++;
            continue;
        }
        hub_control_t cc;
        if (cloud_awaiting && now < cloud_reply_deadline &&
            f.seq == cloud_expected_seq &&
            hub_proto_decode_control(&f, &cc) == 0) {
            cloud_last = cc;
            cloud_last_valid = 1;
            cloud_last_ms = now;
            cloud_awaiting = 0;
            printf("[NET] cloud fan=%u pump=%u theme=%u mood=%u speech=%s\n",
                   cc.fan_level, cc.pump_on, cc.theme_id, cc.mood, cc.speech);
        }
        off += (size_t)r;
    }
    if (off > 0) {
        size_t rem = cloud_rx_len - off;
        for (size_t i = 0; i < rem; i++)
            cloud_rx[i] = cloud_rx[off + i];
        cloud_rx_len = rem;
    } else if (cloud_rx_len == sizeof(cloud_rx)) {
        cloud_rx_len = 0;
    }
}

/* Assembled UI/Live2D state for the on-board renderer. */
static ui_home_state_t g_ui_state;
static live2d_t g_cat;
static char g_last_speech[HUB_SPEECH_MAX + 1];
static uint64_t g_last_speech_ms;
/* How long the newest LLM line stays in the dialog box without a refresh. */
#define SPEECH_STICKY_MS 60000U
static ui_home_model_t g_ui_model;
static ui_gfx_t g_ui_gfx;
static uint8_t g_manual_mask;
static uint8_t g_manual_fan;
static uint8_t g_manual_pump;
static uint8_t g_manual_theme;
static uint8_t g_manual_backlight;
static uint8_t g_backlight; /* backlight percent in effect, for the LIGHT card */
static uint64_t g_manual_until;
static int g_ui_ready;

