fQwQf/A20OS/kernel/platform/stm32f103/peripherals.c
/* Which page the panel is showing. The SYS/MEM/TF/BT instrumentation lives on
 * PAGE_DIAG, one level below the hub UI (see ui_diag.h). */
#define PAGE_HOME 0
#define PAGE_DIAG 1
static int g_page;
static ui_diag_model_t g_diag_model;

/* Mirrors ui_home.h's UI_MANUAL_* bits; the mask is handed to the UI model. */
#define MANUAL_FAN  0x01U
#define MANUAL_PUMP 0x02U
#define MANUAL_THEME 0x04U
#define MANUAL_BACKLIGHT 0x08U
#define BACKLIGHT_STEP 10U

static touch_cal_point_t g_cal_points[4];
static unsigned g_cal_index;
static int g_cal_active;
static int g_cal_pressed;
static uint32_t g_cal_raw_x_sum;
static uint32_t g_cal_raw_y_sum;
static unsigned g_cal_sample_count;
static unsigned g_cal_release_count;

/* Config loaded from /CFG/WIFI.TXT at boot (SSID used for a one-shot join). */
static hub_cfg_t boot_cfg;
static int cfg_join_attempted;

static void run_control_tick(uint64_t now);

/* Buzzer feedback durations (ms). */
#define BUZZ_BOOT_MS 120U  /* "hub is alive" chime at startup       */
#define BUZZ_INPUT_MS 30U  /* short chirp on key/touch/IR input     */

/*
 * Non-blocking buzzer: drive PB8 high now and schedule the off in the service
 * loop. Only ever extends an in-progress beep (so a short input chirp can't
 * cut an alert beep short). Buzzer = active buzzer on PB8 (docs/pz §8).
 */
static void hub_buzz(uint64_t now, uint32_t ms) {
    if (buzzer_muted)
        return;
    stm32_buzzer_set(1);
    uint64_t until = now + ms;
    if (!buzzer_active || until > buzzer_off_at)
        buzzer_off_at = until;
    buzzer_active = 1;
}

/* Snapshot the driver status the diagnostics page formats. */
static void diag_state_build(ui_diag_state_t *d) {
    const stm32_memory_info_t *mem = stm32_memory_info();
    const stm32_sdcard_info_t *sd = stm32_sdcard_info();
    const stm32_bluetooth_info_t *bt = stm32_bluetooth_info();
    const stm32_wifi_info_t *w = stm32_wifi_info();

    d->hclk_hz = stm32_hclk_hz();
    d->uptime_s = (uint32_t)(timer_get_ticks() / 1000ULL);
    d->ram_used = mem->internal_ram_used;
    d->ram_total = mem->internal_ram_total;
    d->ext_used = mem->external_ram_used;
    d->ext_total = mem->external_ram_total;
    d->sd_ready = peripherals.sdcard_ready;
    d->sd_fat32 = sd->fat32;
    d->bt_ready = peripherals.bluetooth_ready;
    d->bt_connected = peripherals.bluetooth_connected;
    d->bt_waiting = bt->waiting;
    d->wifi_ready = w->at_responsive;
    d->wifi_joined = w->joined;
    d->wifi_socket = w->socket_connected;
    d->touch_ready = peripherals.touch_armed;
    d->ir_ready = ir_present;
    d->ir_bindings = ir_map_count();
}

static void ui_render_full(void) {
    if (!peripherals.display_ready || g_cal_active)
        return;
    /*
     * Give the loader a turn before painting. A repaint triggered by a state
     * change (tapping the cat, a new cloud mood) would otherwise run before the
     * service loop had read a single frame of the new state, so it drew the
     * procedural placeholder — the sprite visibly vanished on every tap. The
     * loader bursts frame 0 on a state change, so one call is enough.
     */
    live2d_load_service(&g_cat);
    /* Built either way: the diagnostics page borrows this model's palette. */
    ui_home_build(&g_ui_state, &g_ui_model);
    if (g_page == PAGE_DIAG) {
        ui_diag_state_t ds;
        diag_state_build(&ds);
        ui_diag_build(&ds, &g_diag_model);
        ui_render_diag(&g_ui_gfx, &g_diag_model, &g_ui_model);
        g_ui_ready = 1;
        return;
    }
    ui_render_home_ex(&g_ui_gfx, &g_ui_model, &g_cat, NULL, 0, 0, 0);
    if (!live2d_load_draw(&g_ui_gfx, &g_cat))
        ui_render_cat(&g_ui_gfx, &g_ui_model, &g_cat);
    g_ui_ready = 1;
}

static void ui_render_cat_frame(void) {
    if (!g_ui_ready || g_cal_active || g_page != PAGE_HOME ||
        !peripherals.display_ready)
        return;
    if (!live2d_load_draw(&g_ui_gfx, &g_cat))
        ui_render_cat(&g_ui_gfx, &g_ui_model, &g_cat);
}

static void ui_manual_arm(uint8_t mask, uint64_t now) {
    g_manual_mask |= mask;
    g_manual_until = now + MANUAL_OVERRIDE_MS;
}

static void ui_apply_action(ui_action_t action, uint64_t now) {
    if (action == UI_ACTION_NONE)
        return;
    if (action == UI_ACTION_FAN_UP || action == UI_ACTION_FAN_DOWN) {
        int level = g_ui_state.fan_level;
        level += action == UI_ACTION_FAN_UP ? 1 : -1;
        if (level < 0)
            level = 0;
        if (level > 3)
            level = 3;
        g_manual_fan = (uint8_t)level;
        g_ui_state.fan_level = g_manual_fan;
        stm32_fan_set_level(g_manual_fan);
        ui_manual_arm(MANUAL_FAN, now);
    } else if (action == UI_ACTION_PUMP_TOGGLE) {
        g_manual_pump = g_ui_state.pump_on ? 0U : 1U;
        g_ui_state.pump_on = g_manual_pump;
        stm32_pump_set(g_manual_pump);
        ui_manual_arm(MANUAL_PUMP, now);
    } else if (action == UI_ACTION_THEME_CYCLE) {
        g_manual_theme = (uint8_t)((g_ui_state.theme + 1U) % 3U);
        g_ui_state.theme = g_manual_theme;
        ui_manual_arm(MANUAL_THEME, now);
    } else if (action == UI_ACTION_LIGHT_UP || action == UI_ACTION_LIGHT_DOWN) {
        int pct = (int)g_backlight;
        pct += action == UI_ACTION_LIGHT_UP ? (int)BACKLIGHT_STEP
                                            : -(int)BACKLIGHT_STEP;
        if (pct < 0)
            pct = 0;
        if (pct > 100)
            pct = 100;
        g_manual_backlight = (uint8_t)pct;
        g_backlight = g_manual_backlight;
        g_ui_state.backlight = g_manual_backlight;
        stm32_light_sensor_set_manual_brightness(g_manual_backlight);
        ui_manual_arm(MANUAL_BACKLIGHT, now);
    } else if (action == UI_ACTION_MENU) {
        g_page = g_page == PAGE_HOME ? PAGE_DIAG : PAGE_HOME;
        g_ui_ready = 0;
    } else if (action == UI_ACTION_TALK) {
        /*
         * Replay the current line, and ask the proxy for a new one. The cloud
         * is otherwise only asked on a real change or a slow heartbeat
         * (cloud_should_ask), so this is what makes tapping her feel like
         * asking a question. Speech is never invented here.
         */
        live2d_speak(&g_cat, g_ui_state.speech, (uint32_t)now);
        cloud_ask_now = 1;
        last_control_tick = 0;
    }
    g_ui_state.manual_mask = g_manual_mask;
    hub_buzz(now, BUZZ_INPUT_MS);
    ui_render_full();
}

