fQwQf/A20OS/kernel/platform/stm32f103/peripherals.c
/*
 * Long-press a control -> hand it straight back to the rule engine. Tapping a
 * card takes manual ownership for MANUAL_OVERRIDE_MS (10 min); without this
 * there is no way to give it back early and the card just sits on MANU. Returns
 * 1 when it released one, 0 to let the normal tap action run instead.
 */
static int ui_release_manual(ui_action_t action, uint64_t now) {
    uint8_t bit = 0;

    if (action == UI_ACTION_FAN_UP || action == UI_ACTION_FAN_DOWN)
        bit = MANUAL_FAN;
    else if (action == UI_ACTION_LIGHT_UP || action == UI_ACTION_LIGHT_DOWN)
        bit = MANUAL_BACKLIGHT;
    else if (action == UI_ACTION_PUMP_TOGGLE)
        bit = MANUAL_PUMP;
    else if (action == UI_ACTION_THEME_CYCLE)
        bit = MANUAL_THEME;
    if (!bit || !(g_manual_mask & bit))
        return 0;
    g_manual_mask &= (uint8_t)~bit;
    g_ui_state.manual_mask = g_manual_mask;
    last_control_tick = 0; /* let the rule engine retake it now, not in 2s */
    hub_buzz(now, BUZZ_INPUT_MS);
    printf("[TOUCH] long-press -> auto (manual mask=0x%x)\n",
           (unsigned)g_manual_mask);
    ui_render_full();
    return 1;
}

/* Diagnostics-page buttons. CAL and the two radio pokes are here rather than
 * on the home screen because they interrupt what the hub is doing. */
static void apply_diag_action(ui_diag_action_t action, uint64_t now) {
    if (action == UI_DIAG_ACTION_NONE)
        return;
    hub_buzz(now, BUZZ_INPUT_MS);
    switch (action) {
    case UI_DIAG_ACTION_BACK:
        g_page = PAGE_HOME;
        g_ui_ready = 0;
        ui_render_full();
        break;
    case UI_DIAG_ACTION_CALIBRATE:
        /* Calibration owns the whole panel and returns to the home screen. */
        g_page = PAGE_HOME;
        g_ui_ready = 0;
        (void)stm32_peripherals_start_touch_calibration();
        break;
    case UI_DIAG_ACTION_WIFI_SCAN:
        if (stm32_wifi_scan() == 0)
            printf("[WIFI] AP scan started\n");
        ui_render_full();
        break;
    case UI_DIAG_ACTION_BT_TEST: {
        static const char message[] = "A20OS HC05 TEST\r\n";
        if (peripherals.bluetooth_ready &&
            stm32_bluetooth_send(message, sizeof(message) - 1U) == 0)
            printf("[BT] sent test message\n");
        ui_render_full();
        break;
    }
    default:
        break;
    }
}

static ui_action_t ui_action_from_ir(int action) {
    if (action == IR_ACT_FAN_UP)
        return UI_ACTION_FAN_UP;
    if (action == IR_ACT_FAN_DOWN)
        return UI_ACTION_FAN_DOWN;
    if (action == IR_ACT_PUMP_TOGGLE)
        return UI_ACTION_PUMP_TOGGLE;
    if (action == IR_ACT_THEME_CYCLE)
        return UI_ACTION_THEME_CYCLE;
    if (action == IR_ACT_TALK)
        return UI_ACTION_TALK;
    if (action == IR_ACT_MENU)
        return UI_ACTION_MENU;
    if (action == IR_ACT_LIGHT_UP)
        return UI_ACTION_LIGHT_UP;
    if (action == IR_ACT_LIGHT_DOWN)
        return UI_ACTION_LIGHT_DOWN;
    return UI_ACTION_NONE;
}

static ui_action_t ui_action_from_key(stm32_key_t key) {
    if (key == STM32_KEY_UP)
        return UI_ACTION_FAN_UP;
    if (key == STM32_KEY_DOWN)
        return UI_ACTION_FAN_DOWN;
    if (key == STM32_KEY_LEFT)
        return UI_ACTION_PUMP_TOGGLE;
    if (key == STM32_KEY_RIGHT)
        return UI_ACTION_THEME_CYCLE;
    return UI_ACTION_NONE;
}

static int text_command_equal(const char *line, const char *command) {
    while (*line == ' ' || *line == '\t')
        line++;
    while (*command && *line) {
        char a = *line++;
        char b = *command++;
        if (a >= 'a' && a <= 'z')
            a = (char)(a - 'a' + 'A');
        if (a != b)
            return 0;
    }
    while (*line == ' ' || *line == '\t' || *line == '\r' || *line == '\n')
        line++;
    return *command == '\0' && *line == '\0';
}

/*
 * The nine remote keys, in the order the IR remote prints them. IR reaches
 * them by NEC code (IR_DEFAULT_MAP in ir.h); Bluetooth reaches the same nine
 * by sending the bare digit. Keep this table and IR_DEFAULT_MAP in step.
 */
static const ir_action_t remote_key_actions[9] = {
    IR_ACT_FAN_UP,      /* 1 */
    IR_ACT_FAN_DOWN,    /* 2 */
    IR_ACT_PUMP_TOGGLE, /* 3 */
    IR_ACT_THEME_CYCLE, /* 4 */
    IR_ACT_TALK,        /* 5 */
    IR_ACT_MUTE_BUZZER, /* 6 */
    IR_ACT_MENU,        /* 7 */
    IR_ACT_LIGHT_UP,    /* 8 */
    IR_ACT_LIGHT_DOWN,  /* 9 */
};

/* One dispatcher for every remote input (IR, Bluetooth, direction keys), so
 * they cannot drift apart. MUTE is handled here because it drives the buzzer
 * rather than the UI model. */
static void apply_remote_action(int action, uint64_t now) {
    if (action == IR_ACT_NONE)
        return;
    if (action == IR_ACT_MUTE_BUZZER) {
        buzzer_muted = !buzzer_muted;
        if (buzzer_muted) {
            stm32_buzzer_set(0);
            buzzer_active = 0;
        } else {
            hub_buzz(now, BUZZ_INPUT_MS);
        }
        printf("[IN] buzzer=%s\n", buzzer_muted ? "muted" : "on");
        return;
    }
    ui_apply_action(ui_action_from_ir(action), now);
}

/*
 * Bluetooth (HC-05 SPP) command set, kept as small as it can be because it is
 * typed by hand into a phone's serial terminal: send a single digit 1..9 and
 * it does what that key on the IR remote does. The word forms are aliases for
 * readability only.
 *
 *   1 FAN_UP   2 FAN_DOWN  3 PUMP    4 THEME     5 TALK
 *   6 MUTE     7 MENU      8 LIGHT_UP  9 LIGHT_DOWN
 *
 * Pairing already gates who can open the link (the HC-05 PIN is checked by the
 * module before a connection exists), so an established link is not asked to
 * re-authenticate per command.
 */
static int bluetooth_action_from_line(const char *line) {
    const char *p = line;

    while (*p == ' ' || *p == '\t')
        p++;
    if (*p >= '1' && *p <= '9') {
        const char *rest = p + 1;
        while (*rest == ' ' || *rest == '\t' || *rest == '\r' || *rest == '\n')
            rest++;
        if (*rest == '\0')
            return remote_key_actions[*p - '1'];
    }
    if (text_command_equal(line, "FAN_UP") || text_command_equal(line, "FAN+"))
        return IR_ACT_FAN_UP;
    if (text_command_equal(line, "FAN_DOWN") || text_command_equal(line, "FAN-"))
        return IR_ACT_FAN_DOWN;
    if (text_command_equal(line, "PUMP"))
        return IR_ACT_PUMP_TOGGLE;
    if (text_command_equal(line, "THEME"))
        return IR_ACT_THEME_CYCLE;
    if (text_command_equal(line, "TALK"))
        return IR_ACT_TALK;
    if (text_command_equal(line, "MUTE"))
        return IR_ACT_MUTE_BUZZER;
    if (text_command_equal(line, "MENU"))
        return IR_ACT_MENU;
    if (text_command_equal(line, "LIGHT_UP") || text_command_equal(line, "BL+"))
        return IR_ACT_LIGHT_UP;
    if (text_command_equal(line, "LIGHT_DOWN") ||
        text_command_equal(line, "BL-"))
        return IR_ACT_LIGHT_DOWN;
    return IR_ACT_NONE;
}

