fQwQf/A20OS/kernel/platform/stm32f103/peripherals.c
    hub_action_t a;
    hub_controller_step(&hub_ctl, (uint32_t)now, &s, &a);

    /*
     * Cloud-preferred: send the snapshot to the proxy and apply its CONTROL if
     * it answers in time; otherwise keep the local rule-engine decision. The
     * controller's own hysteresis state stays based on the local decision, so
     * the fallback remains coherent when the network drops.
     */
    int cloud = 0;
    const stm32_wifi_info_t *w = stm32_wifi_info();
    /*
     * Send this snapshot to the proxy when the socket is up, no request is in
     * flight, and there is actually something to ask about (see
     * cloud_should_ask). The reply (a CONTROL frame) arrives asynchronously and
     * is parsed in cloud_net_service(); we apply the freshest one below.
     */
    if (w->socket_connected && !w->command_busy &&
        !cloud_awaiting && cloud_should_ask(&s, now)) {
        uint8_t txf[HUB_OVERHEAD + 8];
        uint8_t seq = net_seq++;
        int tn = hub_proto_encode_snapshot(seq, &s, txf, sizeof(txf));
        if (tn > 0 && stm32_wifi_send(txf, (size_t)tn) == 0) {
            cloud_awaiting = 1;
            cloud_expected_seq = seq;
            cloud_reply_deadline = now + CLOUD_REPLY_TIMEOUT_MS;
            cloud_last_ask_ms = now;
            cloud_asked_snap = s;
            cloud_ask_now = 0;
        }
    }
    /* Cloud-preferred, local fail-safe: override with a fresh cloud decision. */
    if (cloud_last_valid &&
        now - cloud_last_ms <= CLOUD_FRESH_MS) {
        a.decision.fan_level = cloud_last.fan_level;
        a.decision.pump_on = cloud_last.pump_on;
        a.decision.theme = (env_theme_t)cloud_last.theme_id;
        cloud = 1;
    }
    if (g_manual_mask && now >= g_manual_until)
        g_manual_mask = 0;
    if (g_manual_mask & MANUAL_FAN)
        a.decision.fan_level = g_manual_fan;
    if (g_manual_mask & MANUAL_PUMP)
        a.decision.pump_on = g_manual_pump;
    if (g_manual_mask & MANUAL_THEME)
        a.decision.theme = (env_theme_t)g_manual_theme;
    if (g_manual_mask & MANUAL_BACKLIGHT)
        a.decision.backlight = g_manual_backlight;
    g_backlight = a.decision.backlight;

    /*
     * Assemble the home-screen + catgirl state for the renderer. Speech is the
     * cloud (LLM) line only; a new line makes the catgirl talk, otherwise she
     * follows the derived mood (without interrupting an active TALK).
     */
    hub_ui_input_t uin;
    uin.snap = s;
    uin.decision = a.decision;
    uin.minute = (uint8_t)rtc_minute;
    uin.net_cloud = (uint8_t)cloud;
    uin.cloud_valid = (uint8_t)cloud;
    uin.cloud_mood = cloud ? cloud_last.mood : 0;
    uin.cloud_speech = cloud ? cloud_last.speech : (const char *)0;
    uin.manual_mask = g_manual_mask;
    hub_ui_build(&uin, &g_ui_state);
    if (cloud && cloud_last.speech[0] &&
        strncmp(g_last_speech, cloud_last.speech, sizeof(g_last_speech)) != 0) {
        live2d_speak(&g_cat, cloud_last.speech, now); /* new line -> TALK */
        strncpy(g_last_speech, cloud_last.speech, sizeof(g_last_speech) - 1);
        g_last_speech[sizeof(g_last_speech) - 1] = '\0';
        g_last_speech_ms = now;
    } else if (!(g_cat.state == LIVE2D_TALK && g_cat.talk_deadline_ms != 0)) {
        live2d_set_state(&g_cat, hub_ui_state(&uin), now);
    }
    /*
     * Hold the newest line in the dialog box through ticks the proxy did not
     * answer. hub_ui_build only reports speech while a CONTROL is fresh
     * (CLOUD_FRESH_MS), so on a slow reply the box would blank and refill —
     * which reads as a fault, not as silence. This is still the LLM's own
     * text, just the most recent one, and it expires so a stale line cannot
     * outlive the conditions it described.
     */
    if (!g_ui_state.speech && g_last_speech[0] &&
        now - g_last_speech_ms <= SPEECH_STICKY_MS)
        g_ui_state.speech = g_last_speech;

    stm32_fan_set_level(a.decision.fan_level);
    stm32_pump_set(a.decision.pump_on);
    stm32_light_sensor_set_manual_brightness(a.decision.backlight);
    if (a.alert_started)
        hub_buzz(now, HUB_BUZZER_MS); /* alert tone (longer than input chirp) */

    if (a.fan_changed || a.pump_changed || a.alert_started || a.alert_cleared ||
        cloud) {
        printf("[CTRL] src=%s T=%dC H=%u%% L=%u h=%02u v=%u -> fan=%u pump=%u"
               " bl=%u%% theme=%s alert=%s%s\n",
                g_manual_mask ? "manual" : cloud ? "cloud" : "local",
                (int)s.temp_c, s.humidity, s.light,
               s.hour, s.valid, a.decision.fan_level, a.decision.pump_on,
               a.decision.backlight, env_theme_name(a.decision.theme),
               env_alert_name(a.decision.alert),
                a.alert_started ? " (NEW)" : a.alert_cleared ? " (clr)" : "");
    }
#ifndef CONFIG_STM32_LEGACY_DASHBOARD
    ui_render_full();
#endif
}

void stm32_peripherals_service(uint64_t now) {
    uint64_t service_start = timer_get_ticks();
    stm32_watchdog_feed(); /* main loop is alive -> stave off the reset */
#ifdef CONFIG_STM32_LEGACY_DASHBOARD
    stm32_display_update_ticks(now);
#endif

    /* Non-blocking buzzer off-timer (finer than the control tick). */
    if (buzzer_active && now >= buzzer_off_at) {
        stm32_buzzer_set(0);
        buzzer_active = 0;
    }

    if (now - last_control_tick >= CONTROL_TICK_INTERVAL_MS) {
        last_control_tick = now;
        run_control_tick(now);
    }

    live2d_load_service(&g_cat);
    uint32_t live2d_clock = stm32_live2d_frame_clock();
    if (live2d_frame_clock_consume(&last_live2d_clock, live2d_clock)) {
        int changed = live2d_tick(&g_cat, (uint32_t)now);
#ifndef CONFIG_STM32_LEGACY_DASHBOARD
        if (changed)
            ui_render_cat_frame();
#else
        (void)changed;
#endif
    }

    if (ir_present) {
        uint32_t code;
        if (stm32_ir_poll(&code)) {
            int ir_action = ir_map_dispatch(code);
            printf("[IR] code=0x%08x action=%s\n", (unsigned)code,
                   ir_action_name(ir_action));
#ifdef CONFIG_STM32_LEGACY_DASHBOARD
            (void)ir_action;
            hub_buzz(now, BUZZ_INPUT_MS);
#else
            apply_remote_action(ir_action, now);
#endif
        }
    }

    if (peripherals.keys_ready &&
        now - last_key_poll >= KEY_POLL_INTERVAL_MS) {
        last_key_poll = now;
        stm32_key_t key = stm32_keys_poll();
        if (key != STM32_KEY_NONE) {
            static const char *const names[] = {
                "none", "up", "down", "left", "right",
            };
            printf("[KEY] %s\n", names[key]);
#ifdef CONFIG_STM32_LEGACY_DASHBOARD
            hub_buzz(now, BUZZ_INPUT_MS); /* feedback chirp */
            stm32_display_handle_key(key);
            handle_display_actions();
#else
            ui_apply_action(ui_action_from_key(key), now);
#endif
        }
    }

